// -- 1 створити масив та вивести його в консоль:
// - 2 з 5 числових значень
let intArr = [11, 22, 33, 44, 55];
console.log(intArr);

// - 3 з 5 стічкових значень
let stringArr = ['Чайтанья', 'Нитьянанда', 'Адвайта', 'Гадатхара', 'Шриваса'];
console.log(stringArr);

// - 4 з 5 значень стрічкового, числового та булевого типу
let mixArr = ['Харе', 'Кришна', 'Рама', 108, true];
console.log(mixArr);

// 5 -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
let parampara = [];
 parampara[0] = 'Джаганнатха Дас Бабаджи';
 parampara[1] = 'Бхактивинода Тхакур';
 parampara[2] = 'Гауракишора Дас Бабаджи';
 parampara[3] = 'Бхактисиддхантха Сарасвати';
 parampara[4] = 'Бхактиведанта Свами Прабхупада';
console.log(parampara);

// 7 - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
for (let i = 0; i < 10; i++) {
    document.write('<div>Харе Кришна Харе Кришна</div>')
}

// 8 - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
for (let i = 0; i < 10; i++) {
    document.write(`<div>Кришна Кришна Харе Харе ${i}</div>`)
}

// 9 - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
let i = 0;
while (i < 10) {
    document.write('<h1>Харе Рама Харе Рама</h1>');
    i++;
}

// 10 - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
let j = 0;
while (j < 10) {
    document.write(`<h1>Рама Рама Харе Харе ${j}</h1>`);
    j++;
}

// 11 - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
let numArr = [];
for (let i = 0; i < 10; i++) {
    numArr[i] = Math.random();
}
console.log(numArr);

// 12 - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
let stringArray = ['Шри Ишопанишад', 'Бхагавад Гита', 'Шри Упадешамрита', 'Шримад Бхагаватам', 'Бхакти Расамрита Синдху', 'Чайтанья Чаритамрита', 'Махабхарата', 'Брахма Самхита', 'Хари Бхакти Виласа', 'Шикшаштака'];
for (const i in stringArray) {
    console.log(stringArray[i]);
}

// 13 - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
let mixArr13 = [108, 'Гопи', true, 'Бхакти', 16, 'true', false, 'false', '16', '108'];
for (const i in mixArr13) {
    console.log(mixArr13[i]);
}

// 14 - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
let mixArr14 = [108, 'Гопи', true, 'Бхакти', 16, 'true', false, 'false', '16', '108'];
for (const i in mixArr14) {
    if ((typeof mixArr14[i]) === 'boolean') console.log(mixArr14[i]);
}

// 15 - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
let mixArr15 = [108, 'Гопи', true, 'Бхакти', 16, 'true', false, 'false', '16', '108'];
for (const i in mixArr15) {
    if ((typeof mixArr15[i]) === 'number') console.log(mixArr15[i]);
}

// 16 - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
let mixArr16 = [108, 'Гопи', true, 'Бхакти', 16, 'true', false, 'false', '16', '108'];
for (const i in mixArr16) {
    if ((typeof mixArr16[i]) === 'string') console.log(mixArr16[i]);
}

// 17 - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
let mixArr17 = [];
    mixArr17[0] = 11;
    mixArr17[1] = '22';
    mixArr17[2] = 33;
    mixArr17[3] = '44';
    mixArr17[4] = 55;
    mixArr17[5] = '66';
    mixArr17[6] = 77;
    mixArr17[7] = '88';
    mixArr17[8] = 99;
    mixArr17[9] = '108';
for (const i in mixArr17) {
    console.log(mixArr17[i]);
    }

// 18 - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
for (let i = 0; i < 10; i++) {
    console.log(`Поточний номер кроку: ${i}`);
    document.write(`Поточний номер кроку: ${i}<br>`);
}

// 19 - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
for (let i = 0; i < 100; i++) {
    console.log(`Поточний номер кроку: ${i}`);
    document.write(`Поточний номер кроку: ${i}<br>`);
}

// 20 - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
for (let i = 0; i < 100; i+=2) {
    console.log(`Поточний номер кроку: ${i}`);
    document.write(`Поточний номер кроку: ${i}<br>`);
}

// 21 - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
for (let i = 0; i < 100; i++) {
    if ((i % 2) === 0) {
        console.log(`Поточний номер кроку: ${i}`);
     document.write(`Поточний номер кроку: ${i}<br>`);
    }
}

// 22 - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
for (let i = 0; i < 100; i+=2) {
        console.log(`Поточний номер кроку: ${i}`);
     document.write(`Поточний номер кроку: ${i}<br>`);
    }

// 23 - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
for (let i = 0; i < 100; i++) {
    if ((i % 2) !== 0) {
        console.log(`Поточний номер кроку: ${i}`);
     document.write(`Поточний номер кроку: ${i}<br>`);
    }
}

// 24 - Відтворити роботу годинника, відрахувавши 2 хвилини (2 цикли! 1й - хвилини, 2й - секунди)
for (let m = 0; m < 2; m++) {
    for (let s = 0; s < 60; s++) {
        console.log(`${m}:${s}`);
    }
}
console.log('2:00');

// 25 - Відтворити роботу годинника, відрахувавши  2 години 20 хвилини (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)
for (let hh = 0; hh <= 2; hh++) {
    for (let mm = 0; mm < 60; mm++) {
        if ((hh <= 2) && (mm < 20)) {
            for (let ss = 0; ss < 60; ss++) {
                document.write(`${hh}:${mm}:${ss}<br>`);
            }
        }
    }
}
document.write('2:20:00');

// 27 - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
let arr27 = ['a', 'b', 'c'];
let word27 = '';
for (let i = 0; i < arr27.length; i++) {
    word27 = word27 + arr27[i];
}
console.log(word27);

// 28 - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
let arr28 = ['a', 'b', 'c'];
let word28 = '';
let i28 = 0;
while (i28 < arr28.length) {
    word28 = word28 + arr28[i28];
    i28++;
}
console.log(word28);

// 29 - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
let arr29 = ['a', 'b', 'c'];
let word29 = '';
for (const i of arr29) {
    word29 = word29 + i;
}
console.log(word29);

// 30 - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
let arr30 = ['a', 'b', 'c'];
let word30 = '';
for (let i in arr30) {
    word30 = word30 + arr30[i];
}
console.log(word30);

// 37 - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.
let arr37 = ['a', 'b', 'c'];
for (let i = 1; i <= 3; i++) {
    arr37.push(i);    
}
console.log(arr37);

// 38 - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].
let arr38 = [1, 2, 3];
let arr38new = [];
for (let i = arr38.length-1; i > -1; i--) {
    arr38.push(arr38[i]);
}
console.log(arr38new);

// 39 - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
let arr39 = [1, 2, 3];
for (let i = 4; i <= 6; i++) {
    arr39.push(i);    
}
console.log(arr39);

// 40 - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.
let arr40 = [1, 2, 3];
for (let i = 6; i >= 4; i--) {
    arr40.unshift(i);    
}
console.log(arr40);

// 41 - Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()
let arr41 = ['js', 'css', 'jq'];
document.write(arr41.shift());

// 42 - Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()
let arr42 = ['js', 'css', 'jq'];
document.write(arr42.pop());

// 43 - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [4, 5].
let arr43 = [1, 2, 3, 4, 5];
console.log(arr43.slice(3, 5));

// 44 - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [1,2].
let arr44 = [1, 2, 3, 4, 5];
console.log(arr44.slice(0, 2));

// 45 - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice перетворіть масив в [1, 4, 5].
let arr45 = [1, 2, 3, 4, 5];
arr45.splice(1, 2);
console.log(arr45);

// 46 - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
let arr46 = [1, 2, 3, 4, 5];
arr46.splice(3, 0, 'a', 'b', 'c');
console.log(arr46);

// 47 - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
let arr47 = [1, 2, 3, 4, 5];
arr47.splice(1, 0, 'a', 'b', 2, 3, 4, 'c', 5, 'e');
console.log(arr47);

// 48 - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
let arr48 = [11, 22, 33, 44, 55, 66, 77, 88, 99, 108];
for (let i in arr48) {
    if (arr48[i] % 2 === 0) (console.log(`${i+1}-й елемент: ${arr48[i]}`));
}

// 49 - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший
let arr49 = [11, 22, 33, 44, 55, 66, 77, 88, 99, 108];
let arr49new = [];
for (let i in arr49) {
    arr49new.push(arr49[i]);
}
console.log(arr49new);

// 50 - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.
let arr50 = [11, 22, 33, 44, 55, 66, 77, 88, 99, 108];
let arr50new = [];
for (let i in arr50) {
    arr50new[i] = arr50[i];
}
console.log(arr50new);

// 55 зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18] та:
// 56 - перебрати його циклом while
let arr56 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
let i56 = 0;
while (i56 < arr56.length) {
    console.log(arr56[i56]);
    i56++;
}

// 57 - перебрати його циклом for
let arr57 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
for (const i of arr57) {
    console.log(i);
}

// 58 - перебрати циклом while та вивести  числа тільки з непарним індексом 
let arr58 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
i58 = 0;
while (i58 < arr58.length) {
    if (i58 % 2 !==0) (console.log(`${i58+1}-й елемент: ${arr58[i58]}`));
    i58++;
}

// 59 - перебрати циклом for та вивести  числа тільки з непарним індексом
let arr59 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
for (let i in arr59) {
    if (i % 2 !==0) (console.log(`${i+1}-й елемент: ${arr59[i]}`));
    i++;
}

// 60 - перебрати циклом while та вивести  числа тільки парні  значення
let arr60 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
i60 = 0;
while (i60 < arr60.length) {
    if (arr60[i60] % 2 === 0) console.log(arr60[i60]);
    i60++;
}

// 61 - перебрати циклом for та вивести  числа тільки парні  значення
let arr61 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
for (let i = 0; i < arr61.length; i++) {
    if (arr61[i] % 2 === 0) console.log(arr61[i]);
}

// 62 - замінити кожне число кратне 3 на слово "okten"
let arr62 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
for (let i = 0; i < arr62.length; i++) {
    if (arr62[i] % 3 === 0) arr62[i] = 'okten';
}
console.log(arr62);

// 63 - вивести масив в зворотньому порядку.
let arr63 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
console.log(arr63.reverse());

// 64 - всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18] та:
// 1 перебрати його циклом while
let arr641 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
let i641 = arr641.length-1;
while (i641 > -1) {
    console.log(arr641[i641]);
    i641--;
}

// 2 перебрати його циклом for
let arr642 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
for (let i = arr642.length-1; i > -1; i--) {
    console.log(arr642[i]);
}

// 3 перебрати циклом while та вивести  числа тільки з непарним індексом 
let arr643 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
i643 = arr643.length-1;
while (i643 > -1) {
    if (i643 % 2 !==0) (console.log(`${i643+1}-й елемент: ${arr643[i643]}`));
    i643--;
}

// 4 перебрати циклом for та вивести  числа тільки з непарним індексом
let arr644 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
for (let i = arr644.length-1; i > -1; i--) {
    if (i % 2 !==0) (console.log(`${i+1}-й елемент: ${arr644[i]}`));
}

// 5 перебрати циклом while та вивести  числа тільки парні  значення
let arr645 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
i645 = arr645.length-1;
while (i645 > -1) {
    if (arr645[i645] % 2 === 0) console.log(arr645[i645]);
    i645--;
}

// 6 перебрати циклом for та вивести  числа тільки парні  значення
let arr646 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
for (let i = arr646.length-1; i > -1; i--) {
    if (arr646[i] % 2 === 0) console.log(arr646[i]);
}

// 7 замінити кожне число кратне 3 на слово "okten"
let arr647 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
for (let i = arr647.length-1; i > -1; i--) {
    if (arr647[i] % 3 === 0) arr647[i] = 'okten';
}
console.log(arr647.reverse());

// 66 створити пустий масив та :
// 67 - заповнити його 50 парними числами за допомоги циклу
let arr67 =[];
for (let i = 0, j = 0; i < 50; i++, j+=2) {
    arr67[i] = j;
}
console.log(arr67)

// 68 - заповнити його 50 непарними числами за допомоги циклу.
let arr68 = [];
for (let i = 0, j = 1; i < 50; i++, j+=2) {
    arr68[i] = j;
}
console.log(arr68);

// 75 используя Math.random заполнить массив из ???(сколько хотите) элементов. сначала пробуйте БЕЗ ДИАПАЗОНА!
let arr75 = [];
for (let i = 0; i < 108; i++) {
    arr75[i] = Math.round(Math.random()*10);
    console.log(arr75);
}

// 76 диапазон рандома 8 до 732. 
let arr76 = [];
for (let i = 0; i <= 108; i++) {
    let min = 8, max = 732;
    arr76[i] = Math.round(min + Math.random() * (max - min));
}
console.log(arr76);

// 77 вывести на консоль  каждый третий елемент
// 78 но при условии что его значение является парным.
let arr77 = [];
for (let i = 0; i <= 108; i++) {
    let min = 8, max = 732;
    arr77[i] = Math.round(min + Math.random() * (max - min));
    }
    for (let j = 2; j < arr77.length; j+=3) {
        if (arr77[j] % 2 === 0) console.log(`${j+1}-й елемент: ${arr77[j]}`);
    }

// 80 вывести на консоль  каждый третий елемент, но при условии что он имеет парное значение и записать их в другой массив.
let arr80 = [];
let arr80new = [];
for (let i = 0; i <= 108; i++) {
    let min = 8, max = 732;
    arr80[i] = Math.round(min + Math.random() * (max - min));
    }
for (let i = 0, j = 2; j < arr80.length; j+=3, i++) {
    if (arr80[j] % 2 === 0) {
        console.log(`${j+1}-й елемент: ${arr80[j]}`);
        arr80new.push(arr80[j]);
    }
}
console.log(arr80new);

// 83 Вывести каждый елемент массива у которого соседний с права элемент - парный
let arr83 = [];
let arr83new = [];
for (let i = 0; i <= 108; i++) {
    let min = 8, max = 732;
    arr83[i] = Math.round(min + Math.random() * (max - min));
    }
for (let i = 0; i < arr83.length; i++) {
    if (arr83[i+1] % 2 === 0) {
        console.log(`${i+1}-й елемент: ${arr83[i]}`);
        arr83new.push(arr83[i]);
    }
}
console.log(arr83);

// 84 масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. обрахувати середній чек.
let arr84 = [100, 250, 50, 168, 120, 345, 188];
let sum = 0;
for (let i = 0; i < arr84.length; i++) {
    sum = sum + arr84[i];   
}
console.log(sum/arr84.length)

// 86 створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
let arr86 = [], arr86new = [];
for (let i = 0; i < 10; i++) {
    arr86[0] = Math.random() * 5;
    arr86new.push(arr86.shift());
}
console.log(arr86new);

// 87 створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо об'єкт є числом, додати його в інший масив.
let arr87 = [108, 'Харибол', 16, NaN, 64/100*78, true, 64, '228', -0, undefined, '42', false, 46%10, '777', 3.14/0, Infinity/Infinity];
let arr87new = [];
for (let i = 0; i < arr87.length; i++) {
    if (typeof(arr87[i]) === 'number') {
        arr87new.push(arr87[i]);    
    }
}
console.log(arr87new);